# **Indexadores**

* Os DataFrames possuem indexadores para seleção de dados.
* Esses indexadores fornecem uma forma fácil e rápida de selecionar um conjunto de dados de um DataFrame.
* Alguns deles são:
    * T: usado para transpor linhas e colunas.
    * at: acessa um único elemento utilizando rótulos.
    * iat: acessa um único elemento utilizando índices.
    * loc: seleção de elementos utilizando rótulos.
    * iloc: seleção de elementos utilizando índices.

In [1]:
import pandas as pd

In [2]:
dados = [("Ana", 21), ("Pedro", 22), ("Fernanda", 34)]
dt = pd.DataFrame(dados, columns = ["Nomes", "Idades"], index = ["A", "B", "C"])
display(dt)

      Nomes  Idades
A       Ana      21
B     Pedro      22
C  Fernanda      34

# **T** (transposta)
* O que é linha vira coluna e vice versa

In [3]:
dt.T # ou dt.transpose()

          A      B         C
Nomes   Ana  Pedro  Fernanda
Idades   21     22        34

# **at** 
* O indexador at acessa um único elemento do DataFrame utilizando o rótulo da linha e da coluna.

In [22]:
# Sintaxe dt.at[linha, coluna]

# Quero o nome ana
display(dt)
            #Linha, coluna
display(dt.at["A", "Nomes"]) # Quero o nome Ana
display(dt.at["B", "Nomes"]) # Quero o nome Pedro
print(f"O {dt.at["B", "Nomes"]} tem {dt.at["B", "Idades"]} anos de idade")
print(f"O {dt["Nomes"]["B"]} tem {dt["Idades"]["B"]} anos ") # Outra forma de selecionar elementos onde a sintaxe é dt[Coluna][linha]

      Nomes  Idades
A       Ana      21
B     Pedro      22
C  Fernanda      34

'Ana'

'Pedro'

O Pedro tem 22 anos de idade
O Pedro tem 22 anos

In [5]:
dt.at["B", "Nomes"]

'Pedro'

# **iat**: indexador iat acessa os elemento ou sleleciona um elemento do dataFrame através dos índices e não pelos rótulos
* **Sintaxe:** dt.iat[1,0]
    *   onde: 1 - é a linha e o 0 - é a coluna
* **obs:** Se vc indexexar através de rótulos não vai funcionar
    * Exemplo de dados rótolado: dt.iat["B", "Idade"]

In [6]:
# Quero o nome pedro
display(dt.iat[1, 0])
# se for display(dt.iat[1, "Nomes"]) -  Vai dar um erro = "iAt based indexing can only have integer indexers"

'Pedro'

In [7]:
dt.iat[2, 0]

'Fernanda'

# **loc[[linha0, linha2,...]]**: 
* Ela seleciona a linha e a coluna por meio de rotulos.
* indexador loc seleciona um conjunto de linhas e de colunas através dos rótulos ou por uma lista de valores booleanos.

In [8]:
dt.loc[["A", "C"]] # Quero a linha A e a linha C

      Nomes  Idades
A       Ana      21
C  Fernanda      34

In [24]:
dt.loc[["B"]]

   Nomes  Idades
B  Pedro      22

In [25]:
novo_dict = {
    "Nomes":["Carlos", "Sandro", "Fernando"],
    "Idades": [21, 20, 22]
}
novo_df = pd.DataFrame(novo_dict)
novo_df

      Nomes  Idades
0    Carlos      21
1    Sandro      20
2  Fernando      22

In [26]:
novo_df.loc[[1]] # Selecionou a linha 1

    Nomes  Idades
1  Sandro      20

In [28]:
novo_df.loc[[1,0]]

    Nomes  Idades
1  Sandro      20
0  Carlos      21

In [63]:
novo_df[novo_df["Nomes"]== "Sandro"] # Outra forma de selecionar tabelas

    Nomes  Idades
1  Sandro      20

In [65]:
novo_df[novo_df["Nomes"]== "Fernando"]

      Nomes  Idades
2  Fernando      22

In [95]:
# Os dois métodos acima podem ser usados para pesquisar um certo nome ou Dado na tabela e no fim podes selecionar ambas as  linhas usando o loc 
# Da seguinte forma
display(novo_df.loc[[1,2]])
print(novo_df.loc[[1,2], "Nomes"])

      Nomes  Idades
1    Sandro      20
2  Fernando      22

1      Sandro
2    Fernando
Name: Nomes, dtype: object

## **Att:** O indexador loc não opera com índices. Um erro é gerado caso índices sejam fornecidos

In [100]:
# dt.loc[[0,1]]  # dara esse erro: "None of [Index([0, 1], dtype='int64')] are in the [index]"

# **iloc[[index]]**
* O indexador **iloc** seleciona um conjunto de linhas e de colunas baseado unicamente em índices.

In [72]:
novo_df

      Nomes  Idades
0    Carlos      21
1    Sandro      20
2  Fernando      22

In [74]:
dt

      Nomes  Idades
A       Ana      21
B     Pedro      22
C  Fernanda      34

In [75]:
# Selecionar dados na tabela "dt"

dt.iloc[[0]] # Selecionando a linha e coluna 0 (Nome, Idade)

  Nomes  Idades
A   Ana      21

In [77]:
dt.iloc[[0,2]] # Seleiconando a coluna da fernanda e da Ana

      Nomes  Idades
A       Ana      21
C  Fernanda      34

In [81]:
# Selecionar dados na tabela "novo_df"

novo_df.iloc[[0]] # Selecionando a linha e a coluna 0

    Nomes  Idades
0  Carlos      21

In [82]:
novo_df.iloc[[1,0]]

    Nomes  Idades
1  Sandro      20
0  Carlos      21

In [89]:
novo_df.iloc[[1,0]]

    Nomes  Idades
1  Sandro      20
0  Carlos      21

## **Att:**  O indexador iloc não opera com rótulos. Um erro é gerado caso rótulos sejam fornecidos.

In [104]:
# dt.iloc[["A", "B"]] # O erro será:  ValueError: invalid literal for int() with base 10: np.str_('A')